## Dummy Variables and One hot Encoding

##### To convert categorical data into numerical data is called encoding.. Encoding is necessary because ML algorithms dose not support categorical data

##### jb hmary pass data sirf true, false / yes, no ki form me hy tou one hot encoding krty , js k two ways hy  , one by Dummy variables and other is by Scikit learn

In [46]:
import pandas as pd
df  = pd.read_csv("loan.csv")
df.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [15]:
df.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [6]:
df["Gender"] = df["Gender"].fillna(df["Gender"].mode()[0])

In [47]:
df["Property_Area"].unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [14]:
df["Married"]  = df["Married"].fillna(df["Married"].mode()[0])

##### Two ways to perform one way hot encoding , One is get dummies from pnadas 
##### the other is through Scikit_learn

In [17]:
en_data  = df[["Gender", "Married"]]
pd.get_dummies(en_data)

     Gender_Female  Gender_Male  Married_No  Married_Yes
0            False         True        True        False
1            False         True       False         True
2            False         True       False         True
3            False         True       False         True
4            False         True        True        False
..             ...          ...         ...          ...
609           True        False        True        False
610          False         True       False         True
611          False         True       False         True
612          False         True       False         True
613           True        False        True        False

[614 rows x 4 columns]

In [18]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_Female  614 non-null    bool
 1   Gender_Male    614 non-null    bool
 2   Married_No     614 non-null    bool
 3   Married_Yes    614 non-null    bool
dtypes: bool(4)
memory usage: 2.5 KB

#### through Scikit learn

In [19]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()
ohe.fit_transform(en_data) #fit transform data ko understand krta, phr uspr ML algorithm apply krta then transform kr deta hy..

<614x4 sparse matrix of type '<class 'numpy.float64'>'
	with 1228 stored elements in Compressed Sparse Row format>

###### If there are more elements in the matrix that have zero values than those with non-zero values, the matrix is said to be a sparse matrix.

In [24]:
# To convert in array
arr = ohe.fit_transform(en_data).toarray()

In [25]:
pd.DataFrame(arr, columns= ["Gender_Female", "Gender_Male", "Married_No", "Married_Yes"])

     Gender_Female  Gender_Male  Married_No  Married_Yes
0              0.0          1.0         1.0          0.0
1              0.0          1.0         0.0          1.0
2              0.0          1.0         0.0          1.0
3              0.0          1.0         0.0          1.0
4              0.0          1.0         1.0          0.0
..             ...          ...         ...          ...
609            1.0          0.0         1.0          0.0
610            0.0          1.0         0.0          1.0
611            0.0          1.0         0.0          1.0
612            0.0          1.0         0.0          1.0
613            1.0          0.0         1.0          0.0

[614 rows x 4 columns]

In [28]:
# hmary pas 4 columns a gye hain , data zada ho gya hy tou hm drop = "first" kr de gy, Encoding kr k jo b column bnta un me se phly ko delete kr dety
ohe = OneHotEncoder(drop= "first")
arr1 = ohe.fit_transform(en_data).toarray()
arr1

array([[1., 0.],
       [1., 1.],
       [1., 1.],
       ...,
       [1., 1.],
       [1., 1.],
       [0., 0.]])

In [30]:
pd.DataFrame(arr1, columns= [ "Gender_Male", "Married_Yes"])

     Gender_Male  Married_Yes
0            1.0          0.0
1            1.0          1.0
2            1.0          1.0
3            1.0          1.0
4            1.0          0.0
..           ...          ...
609          0.0          0.0
610          1.0          1.0
611          1.0          1.0
612          1.0          1.0
613          0.0          0.0

[614 rows x 2 columns]